test/logs/stress_20260527_004338.log
Log: /home/ubuntu/HTTP-RPC/test/logs/stress_20260527_004338.log

Cookie ready
Test data ready

==============================================
  HTTP-RPC 逐层压测 (v5)
  并发: 20c × 250req = 5000 total
  双 Gateway: gateway-1 + gateway-2
==============================================

=== L0: 阶梯加压 (stepwise ramp-up, 找拐点) ===

  --- 10c × 100req/conn = 1000 total ---
  QPS=42022.10  P50=0         P99=1       

  --- 20c × 100req/conn = 2000 total ---
  QPS=42616.66  P50=0         P99=1       

  --- 50c × 100req/conn = 5000 total ---
  QPS=35500.02  P50=0         P99=2       

  --- 100c × 100req/conn = 10000 total ---
  QPS=25826.71  P50=1         P99=5       

  --- 200c × 100req/conn = 20000 total ---
  QPS=28795.08  P50=2         P99=8       
  拐点: 并发=N/Ac, QPS≈N/A req/s

=== L1a: 内网直连 gateway-1:8081 (无 TLS) ===
  gateway-1 reachable

=== gateway-1 健康基线 (无鉴权) (5000 req × 20c — ab keep-alive) ===
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking gateway-1 (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        gateway-1
Server Port:            8081

Document Path:          /api/health
Document Length:        19 bytes

Concurrency Level:      20
Time taken for tests:   0.124 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    4957
Total transferred:      1559441 bytes
HTML transferred:       95000 bytes
Requests per second:    40329.09 [#/sec] (mean)
Time per request:       0.496 [ms] (mean)
Time per request:       0.025 [ms] (mean, across all concurrent requests)
Transfer rate:          12283.37 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     0    0   0.2      0       2
Waiting:        0    0   0.2      0       2
Total:          0    0   0.2      0       2

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      1
  99%      1
 100%      2 (longest request)
Requests per second:    40329.09 [#/sec] (mean)
  50%      0
  95%      1
  99%      1
 100%      2 (longest request)
  Failed: 0  |  Non-2xx: 

=== gateway-1 Sheet List (Cookie+gRPC) (5000 req × 20c — ab keep-alive) ===
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking gateway-1 (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        gateway-1
Server Port:            8081

Document Path:          /api/sheets
Document Length:        1174 bytes

Concurrency Level:      20
Time taken for tests:   11.472 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    4960
Total transferred:      7344480 bytes
HTML transferred:       5870000 bytes
Requests per second:    435.83 [#/sec] (mean)
Time per request:       45.889 [ms] (mean)
Time per request:       2.294 [ms] (mean, across all concurrent requests)
Transfer rate:          625.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2  41.8      0    1045
Processing:     6   44  18.5     41     234
Waiting:        5   44  18.5     41     234
Total:          6   46  47.1     41    1279

Percentage of the requests served within a certain time (ms)
  50%     41
  66%     47
  75%     52
  80%     56
  90%     67
  95%     79
  98%     94
  99%    108
 100%   1279 (longest request)
Requests per second:    435.83 [#/sec] (mean)
  50%     41
  95%     79
  99%    108
 100%   1279 (longest request)
  Failed: 0  |  Non-2xx: 

=== L1b: 内网直连 gateway-2:8081 (无 TLS) ===
  gateway-2 reachable

=== gateway-2 健康基线 (无鉴权) (5000 req × 20c — ab keep-alive) ===
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking gateway-2 (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        gateway-2
Server Port:            8081

Document Path:          /api/health
Document Length:        19 bytes

Concurrency Level:      20
Time taken for tests:   0.120 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    4958
Total transferred:      1559454 bytes
HTML transferred:       95000 bytes
Requests per second:    41779.47 [#/sec] (mean)
Time per request:       0.479 [ms] (mean)
Time per request:       0.024 [ms] (mean, across all concurrent requests)
Transfer rate:          12725.23 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     0    0   0.2      0       2
Waiting:        0    0   0.2      0       2
Total:          0    0   0.2      0       2

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      1
  99%      1
 100%      2 (longest request)
Requests per second:    41779.47 [#/sec] (mean)
  50%      0
  95%      1
  99%      1
 100%      2 (longest request)
  Failed: 0  |  Non-2xx: 

=== gateway-2 Sheet List (Cookie+gRPC) (5000 req × 20c — ab keep-alive) ===
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking gateway-2 (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        gateway-2
Server Port:            8081

Document Path:          /api/sheets
Document Length:        1174 bytes

Concurrency Level:      20
Time taken for tests:   11.646 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    4960
Total transferred:      7344480 bytes
HTML transferred:       5870000 bytes
Requests per second:    429.33 [#/sec] (mean)
Time per request:       46.584 [ms] (mean)
Time per request:       2.329 [ms] (mean, across all concurrent requests)
Transfer rate:          615.86 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1  25.7      0    1050
Processing:     8   46  16.6     43     172
Waiting:        7   46  16.6     43     172
Total:          8   47  30.5     43    1106

Percentage of the requests served within a certain time (ms)
  50%     43
  66%     50
  75%     55
  80%     58
  90%     68
  95%     77
  98%     89
  99%     99
 100%   1106 (longest request)
Requests per second:    429.33 [#/sec] (mean)
  50%     43
  95%     77
  99%     99
 100%   1106 (longest request)
  Failed: 0  |  Non-2xx: 

=== L1d: 内网写入压测 (容器内 curl, 10c 并发创建→获取→更新→删除) ===
  10c 并发 × 5 轮 = 50 次写入循环
  每循环: POST create → GET → PUT update → POST delete
OK_COUNT=50
ERR_COUNT=0
0
ELAPSED_MS=2212
OPS_SEC=90.4
  写入成功率: 50/50
    总耗时: 2212ms 
    写入吞吐: 90.4 ops/s (每 op = 4 次 HTTP 调用) 

=== L2: 本地 nginx TLS (localhost:443 → least_conn → gateway-1/2) ===

[WARN]   nginx api_limit (rate=100r/s burst=50) 可能触发 429 — 压测时建议注释 limit_req
  [健康基线]
Failed requests:        4130
Requests per second:    11523.95 [#/sec] (mean)
  50%      1
  95%      3
  99%      4
 100%     45 (longest request)

  [Sheet List — Cookie+gRPC+Redis 完整链路]
Failed requests:        0
Requests per second:    352.75 [#/sec] (mean)
  50%     53
  95%     93
  99%    116
 100%    206 (longest request)

=== L3: 公网全链路 (https://106.53.100.198) ===

Requests per second:    5696.40 [#/sec] (mean)
  50%      2
  95%      5
  99%      7
 100%    105 (longest request)

=== L4: gateway 故障转移 (停 gateway-1，流量应切到 gateway-2) ===

  暂停 gateway-1...
http-rpc-gateway-1-1
  gateway-1 已暂停，发送 20 个请求（期望全部成功，走 gateway-2）
  失败请求: 8 / 20
  故障转移异常 (8 次失败)
  恢复 gateway-1...
http-rpc-gateway-1-1
  gateway-1 已恢复

=== L5: 稳定性测试 (30min 全时长, 8r + 2w 混合负载) ===
  预创建 100 条测试数据（并行）...